package com.company;

public class Main {
    /**
     * Придумать классы для нескольких задач.
     * - Интернет-магазин
     * - Система учета для парковки автомобилей
     * - Система грузоперевозок по стране
     * Примечание:
     * - В рамках этого задания не нужно программировать бизнес логику. Вы должны придумать типовую систему, понять из каких узлов она состоит, и создать классы с полями, которых, по-вашему будет достаточно, для организации процесса.
     * - Поля их названия и типы придумываем сами)
     * - Для каждого класса, пишем JavaDoc, по которому я должен понять, зачем этот класс.
     * - Для каждой задачи, нужно создать свой пакет.
     */
    public static void main(String[] args) {
        // write your code here
    }
}
